Tekla Open API Reference for Tekla Structures 2025
PropertyElement.Value Property
 The current value of the property.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Value { get; }
Public ReadOnly Property Value As String
	Get
Property Value
Type: String
See Also
Reference
PropertyElement Class
Tekla.Structures.Drawing Namespace